Tekla Open API Reference for Tekla Structures 2025
GraphicObjectHatchAttributes.OffsetX Property
 The offset from the origin in the X-direction.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double OffsetX { get; set; }
Public Property OffsetX As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
GraphicObjectHatchAttributes Class
Tekla.Structures.Drawing Namespace